package me.dakbutfly.sort;

/**
 * Created by rkdgusrnrlrl on 17. 3. 6.
 */
public class TestSort {
    /*
    * 구분
    *   - 구현의 복잡도
    *   - 데이터 저장 장소 (내부 정렬, 외부 정렬)
    *   - 교환 동작
    *    - 레코드 전체를 변경 : 직접 정렬(Direct Sort)
    *       - 부가적인 메모리가 필요 하지 않음
    *       - 교환 복사 작업시 전체 복사해야 함으로 속도가 느림
    *    - 참조(Point)를 변경 : 간접 정력(Indriect Sort)
    *       - 교환 작업시 참조 만 변경하기에 속도가 빠름
    *    - 정렬의 기본 방법
    *       - 삽입에의한 정렬법
    *       - 교환에 의한 정렬법
    *       - 병합에 의한 정렬법
    *       - 선택에 의한 정렬법ㅠ
    * 안정성 : 같은 값을 가지는 경우(동등한 값을 작는 경우) 기존 순서를 보장 하는 지 여부
    *
    *
    *
    *
    *
    *
    *
    * */


}
